tests/cases/coolantChannel/constant/moldingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Stefan benchmark: the process groups are present only because moldingFoam
    requires them; no boundary uses the stage, so the run is a pure
    conduction/solidification problem. The ejection temperature is
    unreachable.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      moldingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    meltTemperature  300;
}

packing
{
    switchFraction   1;
    switchPressure   1e9;

    pressure
    {
        type            constant;
        value           1e5;
    }
}

cooling
{
    ejectionTemperature  50;
    releasePressure      1e5;
}

viscousDissipation  false;


// ************************************************************************* //
