tests/cases/coolantChannel/system/expectedPatterns
moldingFoam: read .*moldingDict
End
