tests/cases/coolantChannel/system/verifyScript
verify-coolant-channel.py
